# frozen_string_literal: true

Lesson.seed(
  :id,
  { id: 1, number: 1, title: 'チャット画面をデザインしよう！', description: 'クラス内で使うチャット画面のデザインに関して学んでいくよ！使う人にとって見やすいデザインを考えながらチャットの画面を作成しよう！' },
  { id: 2, number: 2, title: 'サーバと通信しよう！', description: 'サーバに接続しデータを送受信する方法について学んでいくよ！サーバへの接続からデータを送信・受信する流れを学ぼう！' },
  { id: 3, number: 3, title: '文字を送受信しよう！', description: 'クラス内で使うチャットでテキストを送受信できるようにプログラミングするよ！チャットの仕組みについて学ぼう！' },
  { id: 4, number: 4, title: '画像を送受信しよう！', description: 'テキストだけでは説明が伝わりにくいので画像も扱えると便利だね！そのためにクラス内で使うチャットで画像を送受信できるようにしよう！' },
  { id: 5, number: 5, title: 'チャットを完成させよう！', description: 'これまでのレッスンをふまえてチャット画面のデザインを行い，クラス内で使うチャットでテキストと画像を送受信することができるようにするよ！' }
)
